app/Controllers/Home.php

    public function index()
    {
        // Tampilkan halaman home untuk semua user
        $model = new \App\Models\ArtikelModel();

        // Ambil artikel terbaru untuk ditampilkan di home
        try {
            // Cek apakah tabel kategori ada
            $db = \Config\Database::connect();
            $kategoriExists = $db->tableExists('kategori');

            if ($kategoriExists) {
                // Jika tabel kategori ada, gunakan join
                $artikel = $model
                    ->select('artikel.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                    ->orderBy('artikel.id', 'DESC')
                    ->limit(6)
                    ->findAll();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
 LIMIT 6