app/Controllers/User.php

SELECT *
FROM `user`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);

        // Check if this is a POST request (form submission)
        if ($this->request->getMethod() !== 'POST') {
            return view('user/login');
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $session = session();
        $model = new UserModel();

        // Debug: Log input data
        log_message('info', 'Login attempt - Email: ' . $email);
        log_message('info', 'Login attempt - Password length: ' . strlen($password));

        // Check if email and password are provided
        if (empty($email) || empty($password)) {
            $session->setFlashdata('flash_msg', 'Email dan password harus diisi.');
            return redirect()->to('/user/login');
        }

        $user = $model->where('useremail', $email)->first();